#include "global.h"
#include "gflib.h"
#include "pokemon.h"
#include "pokemon_summary_screen.h"
#include "help_system.h"
#include "task.h"
#include "menu_helpers.h"
#include "link.h"
#include "overworld.h"
#include "graphics.h"
#include "constants/songs.h"
#include "strings.h"
#include "new_menu_helpers.h"
#include "menu.h"
#include "constants/species.h"
#include "constants/items.h"
#include "data.h"
#include "item.h"
#include "constants/party_menu.h"
#include "trade.h"
#include "battle_main.h"
#include "scanline_effect.h"
#include "constants/moves.h"
#include "dynamic_placeholder_text_util.h"
#include "constants/region_map_sections.h"
#include "region_map.h"
#include "field_specials.h"
#include "party_menu.h"
#include "constants/battle.h"
#include "event_data.h"
#include "trainer_pokemon_sprites.h"
#include "battle_anim.h"
#include "pokeball.h"
#include "pokemon_icon.h"
#include "battle_interface.h"
#include "mon_markings.h"
#include "pokemon_storage_system.h"

// Extracts the upper 16 bits of a 32-bit number
#define HIHALF(n) (((n) & 0xFFFF0000) >> 16)

// Extracts the lower 16 bits of a 32-bit number
#define LOHALF(n) ((n) & 0xFFFF)

#define Hp data[1]
#define atk data[2]
#define def data[3]
#define spA data[4]
#define spD data[5]
#define spe data[6]
#define maxValue data[7]
#define total data[8]
#define totalMax data[9]
#define counter data[10]
#define returnTask data[11]


static void PokeSum_Setup_ResetCallbacks(void);
static void PokeSum_Setup_InitGpu(void);
static void PokeSum_Setup_SpritesReset(void);
static u8 PokeSum_HandleLoadBgGfx(void);
static u8 PokeSum_HandleCreateSprites(void);
static void PokeSum_CreateWindows(void);
static u8 PokeSum_Setup_BufferStrings(void);
static void CommitStaticWindowTilemaps(void);
static void PokeSum_Setup_SetVBlankCallback(void);
static void PokeSum_FinishSetup(void);
static void BufferMonInfo(void);
static void BufferMonSkills(void);
static void BufferMonMoves(void);
static u8 StatusToAilment(u32 status);
static void BufferMonMoveI(u8);
static u16 GetMonMoveBySlotId(struct Pokemon * mon, u8 moveSlot);
static u16 GetMonPpByMoveSlot(struct Pokemon * mon, u8 moveSlot);
static void CreateShinyStarObj(u16, u16);
static void CreatePokerusIconObj(u16, u16);
static void PokeSum_CreateMonMarkingsSprite(void);
static void CreateMoveSelectionCursorObjs(u16, u16);
static void CreateMonStatusIconObj(u16, u16);
static void CreateHpBarObjs(u16, u16);
static void CreateExpBarObjs(u16, u16);
static void CreateBallIconObj(void);
static void CreateMonIconSprite(void);
static void PokeSum_CreateMonPicSprite(void);
static void Task_InputHandler_SelectOrForgetMove(u8 taskId);
static void CB2_RunPokemonSummaryScreen(void);
static void PrintInfoPage(void);
static void PrintSkillsPage(void);
static void PrintIvsPage(void);
static void PrintEvsPage(void);
static void PrintMovesPage(void);
static void PokeSum_PrintMoveNamesAndPP(u8 i);
static void PokeSum_PrintTrainerMemo(void);
static void PokeSum_PrintExpPoints_NextLv(void);
static void PokeSum_PrintSelectedMoveStats(void);
static void PokeSum_PrintTrainerMemo_Mon(void);
static void PokeSum_PrintTrainerMemo_Egg(void);
static bool32 MapSecIsInKantoOrSevii(u8 metLocation);
static bool32 IsMultiBattlePartner(void);
static bool32 PokeSum_IsMonBoldOrGentle(u8 nature);
static void PokeSum_PrintTrainerMemo_Mon_NotHeldByOT(void);
static bool32 CurrentMonIsFromGBA(void);
static u8 PokeSum_BufferOtName_IsEqualToCurrentOwner(struct Pokemon * mon);
static void PokeSum_PrintAbilityNameAndDesc(void);
static void PokeSum_PrintTotalIvsStats(void);
static void PokeSum_PrintTotalEvsStats(void);
static void PokeSum_DrawMoveTypeIcons(void);
static void PokeSum_DestroySprites(void);
static void SwapMonMoveSlots(void);
static void SwapBoxMonMoveSlots(void);
static void UpdateCurrentMonBufferFromPartyOrBox(struct Pokemon * mon);
static void PokeSum_SetMonPicSpriteCallback(u16 spriteId);
static void SpriteCB_MoveSelectionCursor(struct Sprite * sprite);
static void UpdateMonStatusIconObj(void);
static void UpdateHpBarObjs(void);
static void UpdateExpBarObjs(void);
static void ShowPokerusIconObjIfHasOrHadPokerus(void);
static void ShowShinyStarObjIfMonShiny(void);
static void DestroyMonMarkingsSprite(void);
static void PokeSum_UpdateMonMarkingsAnim(void);
static s8 SeekToNextMonInSingleParty(s8);
static s8 SeekToNextMonInMultiParty(s8);
static bool32 IsStatsPagesUnlocked(void);
static void ScrollPSSBackground(void);

struct PokemonSummaryScreenData
{
    u8 windowIds[7];

    u8 ballIconSpriteId;
    u8 monPicSpriteId;
    u8 monIconSpriteId;

    u8 inputHandlerTaskId;
    u8 inhibitPageFlipInput;
    u8 isDrawingIvEvsPage;

    u8 numMonPicBounces;

    bool32 isEnemyParty; /* 0x3024 */

    struct PokeSummary
    {
        u8 speciesNameStrBuf[POKEMON_NAME_LENGTH + 1];
        u8 nicknameStrBuf[POKEMON_NAME_LENGTH + 1];
        u8 otNameStrBuf[12];
        u8 otNameStrBufs[2][12];

        u8 dexNumStrBuf[5];
        u8 otIdStrBuf[7];
        u8 itemNameStrBuf[ITEM_NAME_LENGTH + 1];

        u8 genderSymbolStrBuf[3];
        u8 levelStrBuf[7];
        u8 curHpStrBuf[9];
        u8 statValueStrBufs[5][5];
        u8 statIvsStrBufs[7][5];
        u8 statEvsStrBufs[7][5];

        u8 moveCurPpStrBufs[5][11];
        u8 moveMaxPpStrBufs[5][11];
        u8 moveNameStrBufs[5][MOVE_NAME_LENGTH + 1];
        u8 movePowerStrBufs[5][5];
        u8 moveAccuracyStrBufs[5][5];

        u8 expPointsStrBuf[9];
        u8 expToNextLevelStrBuf[9];

        u8 abilityNameStrBuf[13];
        u8 abilityDescStrBuf[52];
    } summary;

    u8 isEgg; /* 0x3200 */
    u8 isBadEgg; /* 0x3204 */

    u8 mode; /* 0x3208 */
    u8 lastIndex; /* 0x3210 */
    u8 curPageIndex; /* 0x3214 */
    u8 isBoxMon; /* 0x321C */
    u8 typeIcons[2]; /* 0x3220 */

    u8 pageFlipDirection; /* 0x3224 */

    u8 lockMovesFlag; /* 0x3234 */

    u8 whichBgLayerToTranslate; /* 0x3238 */
    u8 skillsPageBgNum; /* 0x323C */
    u8 infoAndMovesPageBgNum; /* 0x3240 */
    u8 flippingPages; /* 0x3244 */

    u16 moveTypes[5]; /* 0x3250 */
    u16 moveIds[5]; /* 0x325A */
    u8 numMoves; /* 0x3264 */
    u8 isSwappingMoves; /* 0x3268 */

    u8 curMonStatusAilment; /* 0x326C */

    u8 state3270; /* 0x3270 */
    u8 summarySetupStep; /* 0x3274 */
    u8 loadBgGfxStep; /* 0x3278 */
    u8 spriteCreationStep; /* 0x327C */
    u8 bufferStringsStep; /* 0x3280 */
    u8 state3284; /* 0x3284 */
    u8 selectMoveInputHandlerState; /* 0x3288 */
    u8 switchMonTaskState; /* 0x328C */

    struct Pokemon currentMon; /* 0x3290 */

    union
    {
        struct Pokemon * mons;
        struct BoxPokemon * boxMons;
    } monList;

    MainCallback savedCallback;
    struct Sprite * markingSprite;

    u8 lastPageFlipDirection[2]; /* 0x3300 */
};

struct MonSkillsPrinterXpos
{
    u16 dexNumStr;
    u16 curHpStr;
    u16 atkStr;
    u16 defStr;
    u16 spAStr;
    u16 spDStr;
    u16 speStr;
    u16 expStr;
    u16 toNextLevel;
    u16 curPp[5];
    u16 maxPp[5];
};

struct MonStatsIvsPrinterXpos
{
    u16 HpStr;
    u16 atkStr;
    u16 defStr;
    u16 spAStr;
    u16 spDStr;
    u16 speStr;
    u16 totalIvsStr;
};

struct MonStatsEvsPrinterXpos
{
    u16 HpStr;
    u16 atkStr;
    u16 defStr;
    u16 spAStr;
    u16 spDStr;
    u16 speStr;
    u16 totalEvsStr;
};

struct ExpBarObjs
{
    struct Sprite * sprites[11]; /* 0x00 */
    u16 xpos[11]; /* 0x2c */
    u16 tileTag; /* 0x42 */
    u16 palTag; /* 0x44 */
};

struct HpBarObjs
{
    struct Sprite * sprites[10]; /* 0x00 */
    u16 xpos[10]; /* 0x28 */
    u16 tileTag; /* 0x3c */
    u16 palTag; /* 0x3e */
};

struct MonPicBounceState
{
    u8 animFrame; /* 0x00 */
    u8 initDelay; /* 0x04 */
    u8 vigor; /* 0x08 */
};

struct MoveSelectionCursor
{
    struct Sprite * sprite; /* 0x00 */
    u16 whichSprite; /* 0x04 */
    u16 tileTag; /* 0x06 */
    u16 palTag; /* 0x08 */
};

struct MonStatusIconObj
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

struct PokerusIconObj
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

struct ShinyStarObjData
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

static EWRAM_DATA struct PokemonSummaryScreenData * sMonSummaryScreen = NULL;
static EWRAM_DATA struct MonSkillsPrinterXpos * sMonSkillsPrinterXpos = NULL;
static EWRAM_DATA struct MonStatsIvsPrinterXpos * sMonStatsIvsPrinterXpos = NULL;
static EWRAM_DATA struct MonStatsEvsPrinterXpos * sMonStatsEvsPrinterXpos = NULL;
static EWRAM_DATA struct MoveSelectionCursor * sMoveSelectionCursorObjs[4] = {};
static EWRAM_DATA struct MonStatusIconObj * sStatusIcon = NULL;
static EWRAM_DATA struct HpBarObjs * sHpBarObjs = NULL;
static EWRAM_DATA struct ExpBarObjs * sExpBarObjs = NULL;
static EWRAM_DATA struct PokerusIconObj * sPokerusIconObj = NULL;
static EWRAM_DATA struct ShinyStarObjData * sShinyStarObjData = NULL;
static EWRAM_DATA u8 sLastViewedMonIndex = 0;
static EWRAM_DATA u8 sMoveSelectionCursorPos = 0;
static EWRAM_DATA u8 sMoveSwapCursorPos = 0;
static EWRAM_DATA struct MonPicBounceState * sMonPicBounceState = NULL;

