#include "global.h"
#include "gflib.h"
#include "pokemon.h"
#include "pokemon_summary_screen.h"
#include "help_system.h"
#include "task.h"
#include "menu_helpers.h"
#include "link.h"
#include "overworld.h"
#include "graphics.h"
#include "constants/songs.h"
#include "strings.h"
#include "new_menu_helpers.h"
#include "menu.h"
#include "constants/species.h"
#include "constants/items.h"
#include "data.h"
#include "item.h"
#include "constants/party_menu.h"
#include "trade.h"
#include "battle_main.h"
#include "scanline_effect.h"
#include "constants/moves.h"
#include "dynamic_placeholder_text_util.h"
#include "constants/region_map_sections.h"
#include "region_map.h"
#include "field_specials.h"
#include "party_menu.h"
#include "constants/battle.h"
#include "event_data.h"
#include "trainer_pokemon_sprites.h"
#include "battle_anim.h"
#include "pokeball.h"
#include "pokemon_icon.h"
#include "battle_interface.h"
#include "mon_markings.h"
#include "pokemon_storage_system.h"

// Extracts the upper 16 bits of a 32-bit number
#define HIHALF(n) (((n) & 0xFFFF0000) >> 16)

// Extracts the lower 16 bits of a 32-bit number
#define LOHALF(n) ((n) & 0xFFFF)

// needs conflicting header to match (curIndex is s8 in the function, but has to be defined as u8 here)
extern s16 SeekToNextMonInBox(struct BoxPokemon * boxMons, u8 curIndex, u8 maxIndex, u8 flags);

static void sub_8138B8C(struct Pokemon * mon);
static void sub_8135C34(void);
static void PSS_PlayMonCry(void);

static void PSS_AddTextToWin0(const u8 * str);
static void PSS_AddTextToWin1(const u8 * str);
static void PSS_AddTextToWin2(const u8 * str);
static void PSS_SetInvisibleHpBar(u8 invisible);
static void PSS_SetInvisibleExpBar(u8 invisible);
static void PSS_SetInvisibleMonSprite(u8 invisible);
static void PSS_SetInvisibleMarkings(u8 invisible);
static void PSS_SetInvisiblePokeball(u8 invisible);
static void PSS_SetInvisibleIconStatus(u8 invisible);
static void sub_813ACF8(u8 invisible);
static void sub_813AEB0(u8 invisible);
static void sub_813A0E8(u8 invisible);
static void sub_8139EE4(u8 invisible);
static void PSS_TurnOffScreen(void);
static void PSS_InitDisplay(void);
static void PSS_ResetAll(void);
static u8 PSS_LoadTilesAndMap(void);
static u8 PSS_LoadSpritesData(void);
static void PSS_InitWindows(void);
static u8 sub_8136040(void);
static void sub_8137E28(void);
static void sub_81381C0(void);
static void sub_8136D54(void);
static void PSS_GetDataPokemon(void);
static void PSS_GetStatsPokemon(void);
static void sub_81367B0(void);
static u8 PSS_CheckMonStatus(u32 status);
static void PSS_GetMoveNames(u8);
static u16 PSS_GetMonMove(struct Pokemon * mon, u8 moveSlot);
static u16 PSS_GetMovePP(struct Pokemon * mon, u8 moveSlot);
static void PSS_LoadShinyIndicator(u16, u16);
static void PSS_LoadUnkPoint(u16, u16);
static void PSS_LoadMarkings(void);
static void PSS_LoadMovesSelectCursor(u16, u16);
static void PSS_LoadIconStatus(u16, u16);
static void PSS_LoadHpBar(u16, u16);
static void PSS_LoadExpBar(u16, u16);
static void PSS_LoadPokeball(void);
static void PSS_LoadMonIcon(void);
static void PSS_LoadMonSprite(void);
static void sub_81393D4(u8 taskId);
static void sub_8137EE8(void);
static void PSS_ShowInfoPokemon(void);
static void PSS_ShowMonStats(void);
static void PSS_PrintMoveNamesOrCancel(void);
static void PSS_PrintMoveNamesAndPP(u8 i);
static void PSS_CheckIfMonIsEgg(void);
static void PSS_PrintExpPointAndNextLvTexts(void);
static void PSS_ShowAttackInfo(void);
static void PSS_ShowEggInfo(void);
static void PSS_ShowMonInfo(void);
static bool32 sub_813B838(u8 metLocation);
static bool32 sub_8138B4C(void);
static bool32 PSS_IsNatureBoldOrGentle(u8 nature);
static void PSS_ShowTrainerMemo(void);
static bool32 PSS_IsMonFromGenIII(void);
static u8 sub_813847C(struct Pokemon * mon);
static void PSS_PrintAbilityNameAndDescription(void);
static void PSS_DrawMoveIcon(void);
static void sub_813AF90(void);
static void sub_81380F0(void);
static void sub_81390B0(void);
static void sub_81391EC(void);
static void sub_8139328(struct Pokemon * mon);
static void sub_8139AAC(u16 spriteId);
static void sub_813A124(struct Sprite * sprite);
static void PSS_ShowIconStatus(void);
static void PSS_SetupHpBar(void);
static void PSS_SetupExpBar(void);
static void sub_813ACB4(void);
static void sub_813AF50(void);
static void PSS_UnloadMarkings(void);
static void PSS_GetMarkings(void);
static s8 sub_813B20C(s8);
static s8 sub_813B38C(s8);
static void PSS_ScrollPSSBackground(void);

struct PokemonSummaryScreenData
{
    u8 window[7];

    u8 spriteId_0;
    u8 spriteId_1;
    u8 spriteId_2;

    u8 task;
    u8 unk301C;

    u8 unk3020;

    bool32 isEnemyParty; /* 0x3024 */

    struct PokeSummary
    {
        u8 nickname[POKEMON_NAME_LENGTH + 1];
        u8 specieName[POKEMON_NAME_LENGTH + 1];
        u8 ot_name[12];
        u8 unk304C[2][12];

        u8 dexNum[5];
        u8 ot_id[7];
        u8 heldItem[ITEM_NAME_LENGTH + 1];

        u8 genderSymbol[3];
        u8 level[7];
        u8 unk3090[9];
        u8 unk309C[5][5];

        u8 unk30B8[5][11];
        u8 unk30F0[5][11];
        u8 moveName[5][MOVE_NAME_LENGTH + 1];
        u8 power[5][5];
        u8 unk3188[5][5];

        u8 unk31A4[9];
        u8 unk31B0[9];

        u8 abilityName[13];
        u8 abilityDescription[52];
    } summary;

    u8 isEgg; /* 0x3200 */
    u8 isBadEgg; /* 0x3204 */

    u8 mode; /* 0x3208 */
    u8 unk320C; /* 0x320C */
    u8 lastIndex; /* 0x3210 */
    u8 curPageIndex; /* 0x3214 */
    u8 unk3218; /* 0x3218 */
    u8 isBoxMon; /* 0x321C */
    u8 typeIcons[2]; /* 0x3220 */

    u8 unk3224; /* 0x3224 */
    u8 unk3228; /* 0x3228 */
    u8 unk322C; /* 0x322C */
    u8 unk3230; /* 0x3230 */

    u8 lockMovesFlag; /* 0x3234 */

    u8 unk3238; /* 0x3238 */
    u8 unk323C; /* 0x323C */
    u8 unk3240; /* 0x3240 */
    u8 unk3244; /* 0x3244 */
    u8 unk3248; /* 0x3248 */
    s16 unk324C; /* 0x324C */

    u16 move[5]; /* 0x3250 */
    u16 currentMove[5]; /* 0x325A */
    u8 unk3264; /* 0x3264 */
    u8 unk3268; /* 0x3268 */

    u8 monStatus; /* 0x326C */

    u8 state3270; /* 0x3270 */
    u8 state3274; /* 0x3274 */
    u8 unk3278; /* 0x3278 */
    u8 state; /* 0x327C */
    u8 unk3280; /* 0x3280 */
    u8 unk3284; /* 0x3284 */
    u8 unk3288; /* 0x3288 */
    u8 unk328C; /* 0x328C */

    struct Pokemon currentMon; /* 0x3290 */

    union
    {
        struct Pokemon * mons;
        struct BoxPokemon * boxMons;
    } monList;

    MainCallback savedCallback;
    struct Sprite * markingSprite;

    u8 unk3300[2]; /* 0x3300 */
    u8 unk3304[3]; /* 0x3304 */
    u8 unused[200]; /* 0x3304 */
};

struct Struct203B144
{
    u16 unk00;
    u16 unk02;
    u16 tileTag;
    u16 palTag;
    u16 unk08;
    u16 unk0A;
    u16 unk0C;
    u16 unk0E;
    u16 unk10;

    u16 unk12[5];
    u16 unk1C[5];

    u16 unk26;
};

struct Struct203B160
{
    struct Sprite * sprites[11]; /* 0x00 */
    u16 cordX[11]; /* 0x2c */
    u16 tileTag; /* 0x42 */
    u16 palTag; /* 0x44 */
};

struct Struct203B15C
{
    struct Sprite * sprites[10]; /* 0x00 */
    u16 cordX[10]; /* 0x28 */
    u16 unk3C; /* 0x3c */
    u16 unk3E; /* 0x3e */
};

struct Struct203B170
{
    u8 unk00; /* 0x00 */
    u8 tileTag; /* 0x04 */
    u8 unk08; /* 0x08 */
};

struct Struct203B148
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
    u16 unk08; /* 0x08 */
};

struct Struct203B158
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

struct Struct203B164
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

struct Struct203B168
{
    struct Sprite * sprite; /* 0x00 */
    u16 tileTag; /* 0x04 */
    u16 palTag; /* 0x06 */
};

static EWRAM_DATA struct PokemonSummaryScreenData * sMonSummaryScreen = NULL;
static EWRAM_DATA struct Struct203B144 * sUnknown_203B144 = NULL;
static EWRAM_DATA struct Struct203B148 * sUnknown_203B148[4] = {};
static EWRAM_DATA struct Struct203B158 * sStatusIconSummaryScreen = NULL;
static EWRAM_DATA struct Struct203B15C * sHpBarSummaryScreen = NULL;
static EWRAM_DATA struct Struct203B160 * sExpBarSummaryScreen = NULL;
static EWRAM_DATA struct Struct203B164 * sUnknown_203B164 = NULL;
static EWRAM_DATA struct Struct203B168 * sUnknown_203B168 = NULL;
static EWRAM_DATA u8 sLastViewedMonIndex = 0;
static EWRAM_DATA u8 sUnknown_203B16D = 0;
static EWRAM_DATA u8 sUnknown_203B16E = 0;
static EWRAM_DATA struct Struct203B170 * sUnknown_203B170 = NULL;

extern const u32 gUnknown_8E9B750[];
extern const u32 gUnknown_8E9B950[];
extern const u32 gUnknown_8E9B598[];
extern const u32 gUnknown_8E9BA9C[];
extern const u32 gUnknown_8E9BBCC[];
